{
  "political_m": false,
  "type": "TVSeries",
  "name": "The Acolyte",
  "url": "https://www.imdb.com/tt12262202/",
  "poster": "https://m.media-amazon.com/images/M/MV5BY2RlMmMyNzktNmE1Zi00MWMzLWFkMGEtMzU5OWFhMGMzMzhkXkEyXkFqcGdeQXVyMTQzNTA5MzYz._V1_.jpg",
  "description": "An investigation into a shocking crime spree pits a respected Jedi Master against a dangerous warrior from his past. As more clues emerge, they travel down a dark path where sinister forces reveal all is not what it seems…",
  "review": {
    "author": "abstuliauferre",
    "dateCreated": "2024-06-09",
    "inLanguage": "English",
    "heading": "What happened to the $180 million it cost to film season one of The Acolyte.",
    "reviewBody": "Then I&apos;ve seen episode one and two of The Acolyte.\n\nEight episodes at $180 million or $22.5 million per episode. In terms of production, I get the impression of a cheap 80s science fiction, there was nothing here that would indicate $22.5 million per episode.\n\nRoger Corman could have made both of these episodes in the 80s for less than $100,000 each. When I have seen the first two episodes of The Acolyte, I get a cheap feeling of a bad and cheap CW production which in recent years has often had a bad script, bad actors and a low budget.\n\nAmong the actors, Lee Jung-jae was in a class of his own, otherwise there was a lot of stiff and poor acting from some of the actors, which can often be caused by bad directing.\n\nPlot, script and dialogue were often unforgivably bad and stupid and are totally illogical. I don&apos;t understand how it is possible to write such bad scripts as we see in some TV series and movies nowadays. Has anyone at Disney approved the script before it goes into production?\n\nI wasn&apos;t a big fan of Ahsoka, all the senators and generals were stupid and inept to such an extent that I sided with the Empire.\n\nHowever, Ahsoka was much better with better actors and it was more grandiose and magnificent with many more and better effects and seemed like a much more expensive production.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 38279,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.8
  },
  "contentRating": "TV-14",
  "genre": [
    "Action",
    "Adventure",
    "Drama"
  ],
  "datePublished": "2024-06-04",
  "keywords": "star wars,galaxy,lightsaber,fight,republic",
  "duration": null,
  "actor": [
    {
      "name": "Amandla Stenberg",
      "url": "https://www.imdb.com/name/nm3964350/"
    },
    {
      "name": "Dafne Keen",
      "url": "https://www.imdb.com/name/nm6748436/"
    },
    {
      "name": "Jodie Turner-Smith",
      "url": "https://www.imdb.com/name/nm3853652/"
    }
  ],
  "director": [],
  "creator": [
    {
      "name": "Leslye Headland",
      "url": "https://www.imdb.com/name/nm2853516/"
    }
  ]
}